Revit 2027 API
LightFamily.GetLightShapeStyle Method
 Returns a LightShapeStyle value for the light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightShapeStyle GetLightShapeStyle()
Public Function GetLightShapeStyle As LightShapeStyle
public:
LightShapeStyle GetLightShapeStyle()
member GetLightShapeStyle : unit -> LightShapeStyle
Return Value
LightShapeStyle
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace